app/controllers/todos_controller.rb

	def index
		@todos = Todo.all
---
SELECT "todos".* FROM "todos"

	def create
		@todo = Todo.new(todo_params)

		if @todo.save
---
INSERT INTO "todos" ("description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "hey1"], ["completed", 1], ["created_at", "2018-11-28 03:54:07.375613"], ["updated_at", "2018-11-28 03:54:07.375613"]]

	def show
		@todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
  	@todo = Todo.find(params[:id])
    if @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]

  def update
  	@todo = Todo.find(params[:id])
    if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "todos" SET "description" = ?, "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "alex"], ["completed", 1], ["updated_at", "2018-11-30 00:34:18.457264"], ["id", 9]]

  def complete
  	@todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def list
  	@todos = Todo.all
---
SELECT "todos".* FROM "todos"